<a href="https://colab.research.google.com/github/udaysankarg/AI-Learning-Journey/blob/main/week2/Week2_Python_for_AI.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


# Week 2 - Python for AI
**Author:** Uday Sankar G  
**Date:** 2025-08-09

**Goals for Week 2:**
1. Learn Numpy, Pandas, Matplotlib basics
2. Load and explore datasets
3. Perform basic data cleaning and transformations
4. Visualize data

In [1]:

!pip install -q seaborn

## Section 1 - Numpy Basics

In [2]:

import numpy as np

# Create arrays
a = np.array([1, 2, 3, 4])
b = np.arange(0, 10, 2)  # 0 to 8 with step 2

print("Array a:", a)
print("Array b:", b)

# Array operations
print("a + 5:", a + 5)
print("a * 2:", a * 2)
print("Dot product a·b[:4]:", np.dot(a, b[:4]))

Array a: [1 2 3 4]
Array b: [0 2 4 6 8]
a + 5: [6 7 8 9]
a * 2: [2 4 6 8]
Dot product a·b[:4]: 40

## Section 2 - Pandas Basics

In [4]:

import pandas as pd

# Load dataset (CSV example: Titanic)
url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
df = pd.read_csv(url)

# Explore data
print(df.head())
print(df.info())
print(df.describe())

# Access columns
print(df['Name'].head())

# Handle missing values
df['Age'].fillna(df['Age'].mean())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

## Section 3 - Data Visualization

In [ ]:

import matplotlib.pyplot as plt
import seaborn as sns

# Histogram of Age
plt.hist(df['Age'], bins=20)
plt.title("Age Distribution")
plt.xlabel("Age")
plt.ylabel("Count")
plt.show()

# Count plot of Survived
sns.countplot(x='Survived', data=df)
plt.title("Survival Count")
plt.show()


## Section 4 - Practice Exercise
1. Find the **average fare** paid per class (`Pclass`)  
2. Plot a **bar chart of average fare by class**  
3. Find **correlation** between `Age` and `Fare`


## Section 5 - Quiz / Checkpoint
1. What is the difference between a **Pandas Series** and a **DataFrame**?  
2. How do you handle missing values in a dataset before feeding it into a model?  
3. Which library is better for **matrix operations**, Numpy or Pandas? Why?